# MEPAnalyticalModelData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPAnalyticalModelData Members
MEPAnalyticalModelData Class Methods Properties See Also
---
The MEPAnalyticalModelData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the MEPAnalyticalModelData |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetMEPAnalyticalModelData | Gets the MEP analytical model data of the specified element. |
| GetNodeById | Gets the analytical node with the specified id. |
| GetNodeByIndex | Gets the specified analytical node. |
| GetNumberOfNodes | Returns the number of analytical nodes. |
| GetNumberOfSegments | Returns the number of analytical segments. |
| GetSegmentById | Gets the analytical segment with the specified id. |
| GetSegmentByIndex | Gets the analytical segment at the specified position. |
| GetSegmentData | Gets the analysis data on the specified segment. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsValidNodeId | Verifies if a valid analytical node id. |
| IsValidSegmentId | Verifies if a valid segment id. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace